app/Models/LocalidadesModel.php

UPDATE `Localidades` SET `codigo` = '7', `cep` = '12700-000', `latitude` = '-22.5661976', `longitude` = '-44.970723', `nome` = 'Segundo Retiro', `bairro` = 'Segundo Retiro', `cidade` = 'Cruzeiro', `estado` = 'SP', `pais` = NULL
WHERE `codigo` = '7'
---
    public function update($dados) {
        $db = \Config\Database::connect();
        //$sql = file_get_contents(__DIR__ . '\SQL\Localidades_excluir.sql');

        $table=$db->table($this->table);
        $table->where('codigo',$dados['codigo']);
        if($table->update($dados)){