app/Models/OcorrenciasModel.php

    public function inserir($dados) {
        $db = \Config\Database::connect();
        //$sql = file_get_contents(__DIR__ . '\SQL\Ocorrencias_excluir.sql');

        if($db->table($this->table)->insert($dados)){
---
INSERT INTO `Ocorrencias` (`localidade_codigo`, `enfermidade_codigo`, `dataOcorrencia`, `sexo`, `ano_nasc`, `observacao`) VALUES ('2', '5', '2021-07-22', 'M', '1992', '')